[
    {
        "type": "text",
        "text": "Review",
        "text_level": 1,
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Atomic layer deposition (ALD): from precursors to thin film structures",
        "text_level": 1,
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Markku Leskelä*, Mikko Ritala",
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Department of Chemistry, P.O. Box 55, FIN- 00014, University of Helsinki, Finland",
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Abstract",
        "text_level": 1,
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "The principles of the atomic layer deposition (ALD) method are presented emphasizing the importance of precursor and surface chemistry. With a proper adjustment of the experimental conditions, i.e. temperatures and pulsing times, the growth proceeds via saturative steps. Selected recent ALD processes developed for films used in microelectronics are described as examples. These include deposition of oxide films for dielectrics, and nitride and metal films for metallizations. The use of a plasma source to form radicals is expanding the selection of ALD films to metals. Plasma- enhanced ALD also facilitates the deposition of nitride films at low temperatures. © 2002 Elsevier Science B.V. All rights reserved.",
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Keywords: Atomic layer deposition (ALD); Atomic layer epitaxy (ALE); Thin films",
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "1. Introduction",
        "text_level": 1,
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "The ALD method relies on alternate pulsing of the precursor gases and vapors onto the substrate surface and subsequent chemisorption or surface reaction of the precursors [1]. The reactor is purged with an inert gas between the precursor pulses. With a proper adjustment of the experimental conditions the process proceeds via saturative steps. Under such conditions the growth is stable and the thickness increase is constant in each deposition cycle. The self- limiting growth mechanism facilitates the growth of conformal thin films with accurate thickness on large areas [2]. The growth of different multilayer structures is also straightforward [3]. These advantages make the ALD method attractive for microelectronics for manufacturing of future generation integrated circuits [4].",
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "ALD was originally developed for fabrication of polycrystalline luminescent ZnS:Mn and amorphous  ${\\mathrm{Al}}_{2}{\\mathrm{O}}_{3}$  insulator films for electroluminescent flat panel displays, and the method itself was termed atomic layer epitaxy ALE) [5]. The early ALE literature dealt with polycrystalline II- VI compounds and amorphous oxide films [6]. Since 1985, epitaxial growth of III- V and",
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "II- VI compounds gained much interest [7- 9], but no real breakthrough was achieved in this area due to the complicated surface chemistry. Since the mid 1990s, rapidly increasing interest towards ALD has originated from the silicon based microelectronics. This increase is a consequence of the ever decreasing device dimensions and increasing aspect ratios in integrated circuits (IC). In addition, the required thickness of the films has, in many cases, decreased to the order of a few nanometers and therefore the main drawback of ALD, the low deposition rate, is becoming less important. The processing temperatures should also be kept low (preferably  $< 400^{\\circ}\\mathrm{C})$  .These requirements further increase the attraction of the ALD method in the IC industry [10].",
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "ALD has recently been described in several reviews focusing on different areas: catalysts [11], nanotechnology [12], and electronic and optoelectronic materials [13,14]. In this review the principles of the ALD method are presented emphasizing the importance of precursor and surface chemistry. Based on recent literature, selected ALD processes developed for films used in microelectronics are described as examples and they include deposition of oxide films for dielectrics, and nitride diffusion barriers and metals for metallizations. Plasmaenhanced ALD has recently been introduced to materials applied in silicon based microelectronics and the first papers are reviewed here.",
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "2. Precursor chemistry",
        "text_level": 1,
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "Precursor chemistry plays a key role in ALD. The precursors must of course be volatile and thermally stable but they may be gases, liquids or solids. Precursors must chemisorb on the surface or react rapidly with the surface groups and react aggressively with each other. In that way, it is possible to reach the saturation stage in a short time (less than 1 s) and thereby ensure a reasonable deposition rate. The aggressive reaction requirement is contrary to traditional CVD precursors. The desired ALD reactions should have a large negative  $\\Delta \\mathbf{G}$  value, but unfortunately thermodynamic data are available only for a limited number of precursors. It seems that in ALD, not only the properties of a single precursor molecule are important, but the combination of the precursors also matters.",
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "The number of precursors and reactions used in ALD is high as can be seen from the recent reviews made by the authors [15,16]. The two cases: non- metal precursors; and metal precursors are very different and show different features. The non- metal precursors are usually hydrides  $(\\mathrm{H}_2\\mathrm{O},\\mathrm{H}_2\\mathrm{S},\\mathrm{NH}_3$  and  $\\mathrm{AsH}_3$  ) without problems in volatility and thermal stability. Reactivity at reasonable temperatures  $(< 500^{\\circ}\\mathrm{C})$  and formation of suitable surface species for the metal precursor to be anchored, are properties of  $\\mathrm{H}_2\\mathrm{O}$  and  $\\mathrm{H}_2\\mathrm{S}$  as shown in many ALD papers, but  $\\mathrm{NH_3}$  and  $\\mathrm{AsH}_3$  are examples of precursors with more limited reactivity. In the deposition of oxide films, the importance of surface  $- \\mathrm{OH}$  groups has been reported several times [17,18].",
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "Metal halides, especially chlorides, have been widely applied in ALD for deposition of oxide, sulfide and nitride films [16]. Most of the halides are solids, but in ALD the solid precursors are not a problem because it is just crucial that the precursor dose is large enough to saturate the surface, but the flux must not necessarily be constant or homogeneous. The other important group of compounds is metal alkyls. In many cases (Al, Zn), the alkyl compounds behave almost ideally in making oxide and sulfide films, but in some cases Ga, In) the results have not been very promising due to the complex and unfavorable surface chemistry. Metal alkoxides form the third important group of precursors and they have been successfully employed in several oxide processes [16]. Electropositive metals (alkaline earth metals, rare earth metals) form a challenge for chemical thin film depositions because they do not have many volatile compounds [19].  $\\beta$  - Diketonates are the most studied compounds of these metals and good results have been obtained in growth of alkaline earth sulfide films [20], but the growth of oxide films using water as oxygen source does not work.  $\\beta$  - Diketonates can be used as precursors in deposition of, for example, rare earth oxide but then ozone has been employed as an oxygen source [21,22]. The resulting films have been polycrystalline and contained only small amounts of carbon. Recently, cyclopentadienyl compounds were introduced as ALD precursors and they have been used in deposition of both alkaline earth titanate and sulfide films [23,24]. The commercial availability of new metalorganic precursors is often limited. The scale- up of precursor syntheses and the development of new precursors are challenges for the further progress of ALD in industrial scale.",
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "",
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "During the last 2 years, a few new precursors have been introduced to ALD and reaction mechanistic studies have been carried out for several older precursors. Although halides have been known for a long time as good ALD precursors, not much attention has earlier been given to fluorides, bromides and iodides. Recently, fluorides and iodides have gained more attention, but also new chloride precursors have been taken into use.  $\\mathrm{BCl}_3$  is a new precursor, which has been introduced very recently.  $\\mathrm{BCl}_3$  reacts with ammonia and forms BN film in ALD fashion [25]. Shinogaki et al. [26] reported about the first chloride adduct precursor in their flow modulation CVD process. They used tantalum chloride thioether adduct and ammonia in deposition of TaN films. The important benefit of this adduct is that, unlike  $\\mathrm{TaCl}_5$  itself, it is a liquid. Tungsten hexafluoride has been examined as a precursor for tungsten metal and tungsten nitride films. With smart chemistry  $\\mathrm{WF}_6$  can be transformed to W with disilane [27]. The particular features of the  $\\mathrm{WF}_6 - \\mathrm{Si}_2\\mathrm{H}_6$  process are: it involves an exchange reaction during both reaction steps; the growth rate is high,  $2.5\\mathrm{\\AA} / \\mathrm{cycle}$  and the process window is wide,  $150 - 330^{\\circ}\\mathrm{C}$  . The films were, however, amorphous and rather resistive.  $\\mathrm{WF}_6$  is also a suitable precursor in combination with ammonia for nitride films [28,29]. The stoichiometry of the films may vary but the formation of polycrystalline  $\\mathrm{W}_2\\mathrm{N}$  has been reported. Volatile, in situ prepared tungsten oxofluorides are precursors for tungsten oxide,  $\\mathrm{WO}_3$  [30]. Polycrystalline films can be grown even at  $200^{\\circ}\\mathrm{C}$ $\\mathrm{WF}_6$  could not be used as a precursor for oxide films because of etching effects.",
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "The use of iodides as metal precursor has been studied in deposition of titanium nitride [31], and oxides of titanium [32,33], zirconium [34,35] and tantalum [36]. The oxide formation reaction is enhanced if  $\\mathrm{H}_2\\mathrm{O}_2$  is used instead of water. The reaction is self- limiting at lower temperatures, but at higher temperatures metal iodides slightly decompose. Reaction mechanism studies show that in the case of  $\\mathrm{TiO}_2$  the situation is complicated because of the structural change (anatase- rutile) of the oxide, which changes the growth mechanism [33]. The  $\\mathrm{TiI}_4 - \\mathrm{H}_2\\mathrm{O}_2$  process has even facilitated epitaxial growth at low temperature  $(< 400^{\\circ}\\mathrm{C})$  on single crystal sapphire and  $\\mathrm{MgO}$  substrates [37]. The oxide films grown from the iodides are iodine- free and the properties equal to the films deposited with chloride- water ALD",
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "processes. In the  $\\mathrm{TaI}_5\\mathrm{- H}_2\\mathrm{O}_2$  process, etching takes place above  $350^{\\circ}\\mathrm{C}$  which is  $50^{\\circ}\\mathrm{C}$  higher than in the  $\\mathrm{TaCl}_5\\mathrm{- }$ $\\mathrm{H}_2\\mathrm{O}$  process [36].",
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "A new ALD precursor, triphenyl compound, has been introduced for bismuth [38]. Bismuth oxide cannot be grown from triphenyl bismuth and  $\\mathrm{H}_2\\mathrm{O}_2$  but a ternary  $\\mathrm{Bi - Ti - O}$  could be deposited. In the as- deposited films, bismuth may partially be metallic, and the ternary oxide phase is formed only upon annealing in air at  $500^{\\circ}\\mathrm{C}$  Further annealing at  $700^{\\circ}\\mathrm{C}$  resulted in a crystalline dielectric  $\\mathrm{Bi}_2\\mathrm{Ti}_2\\mathrm{O}_7$  phase, but it was not possible to obtain bismuth titanates with higher bismuth content. A few new alkoxide precursors have been studied for the deposition of zirconium oxide films, namely tetra- tertbutoxide [39], tetrakis- dimethylaminoethoxide (DMAE), and mixed ligand complexes of DMAE with isopropoxide and tert- butoxide [40]. Characteristic for all these precursors is that they already decompose significantly at  $240^{\\circ}\\mathrm{C}$  Interestingly, especially with aminoethoxides, the decomposition appears to be water assisted. However, uniform films could be grown. Vanadium oxide is a new ALD material grown for electrochemical battery purpose [41]. The precursors were vanadyl tri- isopropoxide  $\\mathrm{[VO(O^iPr)_3]}$  and water. The process was self- limiting up to  $180^{\\circ}\\mathrm{C}$  above which the self- decomposition started to play a role.",
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "No effective ALD processes have been found so far for silicon dioxide. In all reports long pulse times have been required to saturate the reactions. An interesting report was recently given by Gordon et al. [42] where they present the deposition of  $\\mathrm{SiO}_2$  from  $N,N^{\\prime}$  - di- tertbutyl- 1,3- diaza- 2- silacyclopent- 4- en- 2- ylidene and oxygen at  $200^{\\circ}\\mathrm{C}$  They flash evaporated the precursor solution and a deposition rate of  $0.05 \\mathrm{nm}/$  cycle was obtained throughout the length  $(30~\\mathrm{cm})$  of the deposition zone.",
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "Metal alkyl amides have been extensively studied as CVD precursors for nitride thin films. Recently they have also been introduced to ALD [43]. Tetrakis(dimethylamido)titanium (or tetrakis(ethylmethylamido)titanium)- ammonia processes have shown to be self- limiting at  $170 - 210^{\\circ}\\mathrm{C}$  when high ammonia doses and long exposure times were employed. The deposition rate was high twice to that of the monolayer growth in the [111] direction of TiN. When silane is added to the process,  $\\mathrm{Ti - Si - N}$  films can be grown and the composition can be varied up to a Si content of 23 at.  $\\%$  by controlling the number of silane pulses [44]. Silane blocks the growth and accordingly the growth rate decreases along the increasing silicon content of the films.  $\\mathrm{Ti - Si - N}$  films showed excellent conformality and barrier properties against Cu diffusion, but are apparently resistive [43]. Tantalum nitride film has been deposited from tert- butylimidotris(diethylamido)- tantalum. Hydrogen radicals were used to reduce this single source precursor [45]. The films were Ta rich in composition and contained approximately  $15\\mathrm{at.\\%}$  of carbon impurity. A new aluminum precursor, dimethyl(aluminum hydride)- ethylenepiperidine has been employed in ALD deposition of AlN films. In that study, the interfaces in TiN/AlN multilayers were of interest [46]. Also, a great variety of oxides can potentially be deposited from the alkyl amides [42].",
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "",
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "Recent ALD literature contains a few reports on new processes where  $\\beta$  - diketonates have been employed in deposition of oxide films.  $\\mathrm{Mg(thd)}_2$ $\\mathrm{thd} = 2,2,6,6$  - tetramethyl- 3,5- heptanedione) can be combined with hydrogen peroxide, and  $\\mathrm{MgO}$  film is formed at  $325 - 425^{\\circ}\\mathrm{C}$  with a growth rate of  $0.10 - 0.14\\mathrm{\\AA} / \\mathrm{cycle}$  [47]. Indium acetylacetonate serves as a precursor in the ALD growth of indium sulfide  $\\mathrm{In}_2\\mathrm{S}_3$  . An amorphous film was deposited at  $160~^\\circ \\mathrm{C}$  with a growth rate of  $0.8\\mathrm{\\AA} / \\mathrm{cycle}$  and it was aimed for  $\\mathrm{CuInSe}_2$  solar cells as a buffer layer [48].",
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "In ALD oxide processes, water has most often been the oxygen source. As mentioned above, ozone has been used when a highly reactive oxidizing agent is needed [21,22]. Ozone is also an applicable precursor to be combined with trimethyl aluminum in deposition of  $\\mathrm{Al}_2\\mathrm{O}_3$  . The authors claim that excellent electrical properties can be achieved with this OH- free process [49]. However, especially for gate oxide applications, the strongly oxidizing character of  $\\mathrm{O}_3$  is of major concern as it easily creates too thick  $\\mathrm{SiO}_2$  interfacial layers. A few recent reports exist where molecular oxygen has been used as the oxygen precursor.  $\\mathrm{TiO}_2$  has been grown from titanium iodide and oxygen at  $200 - 350^{\\circ}\\mathrm{C}$  [50], and  $\\mathrm{ZrO}_2$  from tert- butoxide and oxygen at  $300 - 400^{\\circ}\\mathrm{C}$  [51]. It seems that the metal precursor should be slightly thermally unstable and then oxygen is reactive enough for the oxide formation reaction at these relatively low temperatures. Schuisky et al. [50] were able also with the  $\\mathrm{TiI}_4 + \\mathrm{O}_2$  process to deposit epitaxial rutile on sapphire (012) and anatase on  $\\mathrm{MgO}$  (001) surfaces. The use of oxygen plasma is a new trend in ALD deposition of oxide films.",
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "Water or hydrogen peroxide are not always desired oxygen sources because they may be too oxidative or reactive and therefore, a water- free process based on alkoxides has been developed [4]. The metal alkoxide serves as both metal and oxygen source while the other metal compound, typically a metal chloride, acts as the other metal source:",
        "page_idx": 2
    },
    {
        "type": "equation",
        "text": "\n$$\nbM(\\mathrm{OR})_a + aM'X_b\\rightarrow M_aM'b\\mathrm{O}_{ab} + abRX\n$$\n",
        "text_format": "latex",
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "Depending on whether  $M$  and  $M^{\\prime}$  are similar or different, binary or mixed oxides are obtained. The major benefit of not using separate oxygen precursors is the less susceptible oxidation of the substrate surfaces. This is very important when thin oxide layers are to be deposited directly on silicon without creating an interfacial silicon oxide layer.",
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "In deposition of transition metal nitride films, the development trends from the precursor chemistry point of view are: finding more reactive nitrogen precursors to replace ammonia; and finding reducing agents to reduce the metal ion to the formal oxidation state of  $+$  III. These trends will be addressed in Section 5. One way to overcome the problems with nitrogen precursors and reducing agents is the use of plasma- assisted ALD (see Section 6).",
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "3. Reaction mechanisms",
        "text_level": 1,
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "The ALD reactors used in industrial scale and often in laboratories, are of a flow- type which makes fast pulsing and purging possible. In the flow- type reactors the pressures are 1- 10 mbar which limits the selection of possible in situ characterization methods. Quartz crystal microbalance (QCM) has successfully been used to examine several ALD oxide processes [52,53]. Recently, a quadrupole mass spectrometer (QMS)- ALD reactor set- up has been presented [54,55], and also a QMS- QCM- ALD combination has been used [56]. Optical techniques form another group of methods, which have been used to characterize surface processes in flow type ALD reactors [16]. Both surface photo absorption (SPA) and reflectance difference spectroscopy have been employed. A variation from the SPA technique is termed incremental dielectric reflection (IDR) method and it has been used in analysis of ALD growth of  $\\mathrm{TiO_2}$  [57]. It is worth mentioning that the limitation of optical characterization methods is the lack of chemical information.",
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "The in situ measurements allow the investigation of reaction mechanisms in ALD reaction steps. The QCM signal shows the relative weight of the adsorbed species, while the QMS gives information on the gaseous species releasing in the surface reaction. The measurements are complementary and the results agree [56]. The in situ studies have verified the importance of surface groups in ALD growth. The measurements show, for example in the case of oxide films, how many ligands are released when the metal precursor reacts with the surface  $- \\mathrm{OH}$  groups, i.e. the mechanism of the adsorption step. During the last 2 years several oxide processes involving water as an oxygen source have been studied by QCM. The metal precursors in these studies have been: titanium chloride [58,59]; titanium iodide [32]; titanium ethoxide [60]; titanium isopropoxide [61]; trimethyl aluminum [55,62]; vanadyl isopropoxide [48]; tantalum iodide [36]; and diethyl zinc [63]. QMS or QMS- QCM combinations have been used in studies of reactions of water with titanium chloride [64], titanium isopropoxide [65], and titanium, niobium and tantalum ethoxides [66]. In situ studies can also give useful information on ternary systems. The example on  $\\mathrm{SrTiO_3}$  shows that the adsorption of titanium isopropoxide on SrO is different than the adsorption of strontium bis(tri- isopropylcyclopenta- dienyl) on  $\\mathrm{TiO_2}$  and more strikingly the growth of SrO on SrO is very different than that on  $\\mathrm{TiO_2}$  [67]. The first QMS study on nitride process regarding deposition of TiN and  $\\mathrm{Ti(Al)N}$  has also been carried out [68].",
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "",
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "In situ studies on different titanium precursors in ALD of  $\\mathrm{TiO_2}$  at  $250^{\\circ}\\mathrm{C}$  revealed an interesting and quite unexpected difference in reaction mechanisms; while  $\\mathrm{TiCl_4}$  lost one and  $\\mathrm{Ti(O^iPr)_4}$  two ligands in reactions with surface hydroxyl groups when arriving on the surface, less than  $10\\%$  of the ligands in  $\\mathrm{Ti(OEt)_4}$  were released at this stage. This suggests that  $\\mathrm{Ti(OEt)_4}$  adsorbs molecularly rather than undergoing exchange reactions with surface hydroxyl groups. On the other hand, as the other two cases indicate, there clearly should be hydroxyl groups on the  $\\mathrm{TiO_2}$  surface at this temperature for  $\\mathrm{Ti(OEt)_4}$  to react with. Therefore, another explanation for the observed difference is an adsorption of ethanol formed during the  $\\mathrm{Ti(OEt)_4}$  pulse so that it becomes released from the surface only when replaced by water during the next pulse. Separate experiments verified the ethanol adsorption on  $\\mathrm{TiO_2}$  under these conditions. Above  $250^{\\circ}\\mathrm{C}$ , the behavior of  $\\mathrm{TiCl_4}$  resembled that of  $\\mathrm{Ti(OEt)_4}$ , whereas  $\\mathrm{Ti(O^iPr)_4}$  started to decompose. The decomposition of  $\\mathrm{Ti(OEt)_4}$  commenced beyond  $300^{\\circ}\\mathrm{C}$ .",
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "Besides examining the form in which the precursor is adsorbed on the surface, the in situ studies can also give information on several other aspects, like reaction byproduct re- adsorption and possible etching processes. The latter is important especially when growing niobium or tantalum oxide from pentachlorides.",
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "4. Oxide films",
        "text_level": 1,
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "The recent ALD oxide studies have often dealt with growth mechanism investigations, but also the structural properties of the films have been of interest [32,37,38,69,70]. One important material type of ALD oxides is nanolaminates which consist of alternating layers of two or more insulator materials, so that each separate layer has a thickness in a range of  $1 - 20 \\mathrm{nm}$ . The preparation of nanolaminates with accurately varying composition depth profiles is straightforward in ALD. In nanolaminates the advantageous properties of each component can be retained, for example, in insulators: high permittivity; low leakage current density; and high charge storage capacity [16]. Recently, the effects of niobium oxide layers to tantalum oxide and aluminum oxide have been studied [71,72]. It was shown, for example, that the permittivity of  $\\mathrm{Al}_2\\mathrm{O}_3$  can be increased with  $\\mathrm{Nb}_2\\mathrm{O}_5$  addition without considerable loss in resistivity. The films containing 37 cation% niobium showed similar leakage currents as aluminum oxide films, but upon further increase in Nb content the leakage currents increased markedly.",
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "The ALD oxide films find industrial applications as dielectrics in electroluminescent thin film displays, but in the future gate oxides for MOSFET transistors will also perhaps be processed by ALD. The new gate oxides which will replace  $\\mathrm{SiO}_2$  are very thin, they must be deposited on bare silicon surface, the interface between silicon and the oxide should be tailored, and the gate oxide may also be a multilayer structure. All these requirements are demanding but not impossible for ALD. The gate oxides must be stable on silicon and the materials under investigation are Al, Zr, Hf and rare earth oxides. As mentioned above, all these oxide materials have been deposited by ALD [16]. The focus in the investigations has recently been in structural and electrical characterization of thin oxide films on silicon. High resolution depth- profiling of ultrathin  $\\mathrm{Al}_2\\mathrm{O}_3$  films on Si revealed stoichiometric composition and abrupt interface, and showed that ALD  $\\mathrm{Al}_2\\mathrm{O}_3$  is a possible gate dielectric material for MOS devices with equivalent electrical thickness in the sub  $2\\mathrm{nm}$  range [73]. The robustness of the ultrathin  $\\mathrm{Al}_2\\mathrm{O}_3$  films on Si was studied by high- temperature vacuum annealing at  $900^{\\circ}\\mathrm{C}$  and oxidation at  $600^{\\circ}\\mathrm{C}$ . The results showed that the films were stable in vacuum, but formation of interfacial  $\\mathrm{SiO}_2$  took place during oxidation [74]. The MOSFET results on ALD  $\\mathrm{Al}_2\\mathrm{O}_3$ $(t_{\\mathrm{eq}} = 13\\mathrm{\\AA})$  for  $0.08\\mu \\mathrm{m}$  gate length transistors with poly- Si gates showed a reduction in leakage current of two orders of magnitude compared to  $\\mathrm{SiO}_2$  having the same  $t_{\\mathrm{eq}}$  value [75]. Also, the first results on electrical properties of stacked ALD oxide layers (aluminum or zirconium) on  $\\mathrm{SiO}_2$  have been promising [76,77]. In a very recent study, Gusev et al. [78] found that  $1.5\\mathrm{- }10\\mathrm{- }\\mathrm{nm}$  thick ALD Zr, Hf, Y and Al oxides on silicon all exhibited good interface quality, and gate leakage much lower than conventional  $\\mathrm{SiO}_2$  of the same equivalent electrical thickness. Earlier, they had shown that a highly uniform layer of  $\\mathrm{ZrO}_2$  can be deposited as thin as  $2\\mathrm{nm}$  on top of an  $\\mathrm{SiO}_2$  layer [79]. The  $\\mathrm{SiO}_2$  layer was needed, although it limits the minimum achievable  $t_{\\mathrm{eq}}$  - value, because uniform zirconium oxide is difficult to grow on  $\\mathrm{Si - H}$  terminated surface with the chloride process. In fact, getting a good start for the growth of any oxide on  $\\mathrm{Si - H}$  surface is clearly an important issue for gate oxide applications of ALD. Perkins et al. [80] have shown that ALD processing of polycrystalline  $\\mathrm{ZrO}_2$ $(5\\mathrm{nm})$  on silicon produces an amorphous layer  $(1.5\\mathrm{nm})$ , which has higher dielectric constant than  $\\mathrm{SiO}_2$ . The whole structure has  $t_{\\mathrm{eq}} = 13$ $\\mathrm{\\AA}$  and shows leakage value of  $10^{- 5}\\mathrm{A} / \\mathrm{cm}^2$  at a bias of  $- 1\\mathrm{V}$ .",
        "page_idx": 4
    },
    {
        "type": "text",
        "text": "The nanolaminate concept has so far been slightly problematic in gate oxide application since the permittivity of the oxide films decreases significantly with the film thickness. Equivalent thicknesses of approximately  $3\\mathrm{nm}$  have been achieved in Ta- Hf, Ta- Zr and  $\\mathrm{Zr - Hf}$  oxide nanolaminates [81]. In another study Ta, Ta- Nb",
        "page_idx": 4
    },
    {
        "type": "text",
        "text": "O,  $\\mathrm{Zr - Al - O}$  and  $\\mathrm{Zr - Al - Nb - O}$  oxide and nanolaminates were examined [82]. When  $\\mathrm{Ta}_2\\mathrm{O}_5$  was deposited on silicon, an 8-  $\\mathrm{\\AA}$  - thick  $\\mathrm{SiO}_2$  layer was formed, but the capacitance equivalent oxide thickness of  $\\mathrm{Ta}_2\\mathrm{O}_5$  was  $1.2 - 1.5 \\mathrm{nm}$ . The leakage current density in those films was approximately  $5\\times 10^{- 4}\\mathrm{A} / \\mathrm{cm}^2$  at  $1\\mathrm{MV / cm}$ . In  $\\mathrm{Zr - Al - O}$  films, the relatively high permittivity of  $\\mathrm{ZrO}_2$  was combined with high resistivity of  $\\mathrm{Al}_2\\mathrm{O}_3$ , and films with  $t_{\\mathrm{eq}} = 2 - 2.5 \\mathrm{nm}$  and low leakage could be deposited. When niobium was added to  $\\mathrm{Zr - Al - O}$ ,  $t_{\\mathrm{eq}}$  could be lowered to  $1.8 - 2.0 \\mathrm{nm}$  [82]. Besling et al. [83] achieved better results with  $\\mathrm{ZrO}_2 / \\mathrm{Al}_2\\mathrm{O}_3$  nanolaminates;  $t_{\\mathrm{eq}}$  was  $1.1 \\mathrm{nm}$  and leakage current density  $= 10^{- 7}\\mathrm{A} / \\mathrm{cm}^2$  at  $1\\mathrm{V}$ .",
        "page_idx": 4
    },
    {
        "type": "text",
        "text": "The other concern in deposition of gate oxides is that silicon should not oxidize during the deposition process. One possibility to avoid that is not to use any strongly oxidizing precursor. Metal alkoxides have successfully been used as oxygen source materials in ALD deposition and no oxidation of silicon was observed [4]. The formation of metal silicates when  $\\mathrm{Si(OEt)_4}$  or  $\\mathrm{Si(OBu)_4}$  was used as alkoxide was an important result since silicates may be useful gate dielectric materials too. The exchange reactions between metal halides and alkoxides have further been studied with tantalum oxide and titanium/zirconium oxide [84,85]. The growth proceeds without water, but water can be added as a supplementary oxygen source. The growth rate is dependent on temperature and the growth rate can be increased by introducing the precursors simultaneously (CVD mode) into the reactor. A further extension of this chemistry is the use of metal alkyl amides like  $\\mathrm{Hf(NR_2)_4}$  and  $(\\mathrm{BuO})_3\\mathrm{SiOH}$  [42].",
        "page_idx": 4
    },
    {
        "type": "text",
        "text": "In the future, DRAM capacitors high-  $k$  materials are needed,  $\\mathrm{Ba}_{1 - x}\\mathrm{Sr}_x\\mathrm{TiO}_3$  being the most extensively studied material. Recently, ALD processes have been developed for barium and strontium titanates [16,86] using Sr and Ba cyclopentadienyl compounds as precursors, together with titanium iospropoxide and water. Excellent conformality was achieved in the ALD STO films and the films were crystalline as- deposited at  $325^{\\circ}\\mathrm{C}$  [16]. Permittivity values decrease along the decreasing film thickness, but a value of 100 has been obtained in a 50- nm- thick film. Further works have focused on integration of STO and BTO films with platinum electrodes [87]. If alkaline earth  $\\beta$ - diketonates are used as precursors, the oxygen source must be ozone and deposition post- annealing in air is needed to achieve crystalline titanate phase [88].",
        "page_idx": 4
    },
    {
        "type": "text",
        "text": "5. Nitride films",
        "text_level": 1,
        "page_idx": 4
    },
    {
        "type": "text",
        "text": "Transition metal nitride films are used in ICs as barriers preventing interdiffusion and reactions between metals and silicon or insulators. The barrier films in metallization have strict demands: they should be pure;",
        "page_idx": 4
    },
    {
        "type": "text",
        "text": "dense; conductive; conformal; thin; have good adhesion towards metals and insulators; and the processing temperature should not exceed  $400^{\\circ}\\mathrm{C}$ . The conformality requirement is especially demanding since the aspect ratios of trenches and vias have increased. The requirements concerning process technique can be fulfilled by ALD. The materials studied for this purpose are TiN, TaN and Ta metal. Several ALD nitride processes have been developed and in most of them, ammonia is used as a nitrogen source [15,16]. The problem usually is how to get the transition metal reduced to the formal  $+$  III state needed; especially for TaN, a strong reducing agent is needed, otherwise a dielectric  $\\mathrm{Ta}_3\\mathrm{N}_5$  phase is obtained [89].",
        "page_idx": 5
    },
    {
        "type": "text",
        "text": "The majority of the ALD transition metal nitride processes have been based on metal chlorides and ammonia. Best results have been obtained with metallic zinc as an additional reducing agent [89,90]. Because zinc- containing processes are not acceptable in semiconductor applications, new processes are sought. With titanium iodide, a well conducting nitride film can be deposited without zinc [31]. Studies to find new reducers or more effective nitrogen precursors in combination with metal halides are in progress. As examples, the use of trimethylaluminum (TMA) as a reducing agent [91] and 1,1- dimethylhydrazine as a nitrogen precursor [92] can be mentioned. Low TMA doses clearly assist the formation of nitride films. Dimethylhydrazine reduces Ti, Nb and Mo chlorides and the corresponding low- resistivity nitride films are formed at  $400^{\\circ}\\mathrm{C}$  and, in the case of TiN, even at  $250–400^{\\circ}\\mathrm{C}$  [92]. However,  $\\mathrm{TaCl}_5$  cannot be reduced by dimethylhydrazine.",
        "page_idx": 5
    },
    {
        "type": "text",
        "text": "The growth rate in the chloride- ammonia processes has been low, typically  $0.2\\mathrm{\\AA}$  cycle. It is not known whether this is due to a small number of reactive  $\\mathrm{NH}_x$  groups left on the surface after the  $\\mathrm{NH}_3$  pulse, or due to an adsorption site blocking by re- adsorbed reaction byproduct HCl. Elers et al. [93] were, however, able to almost double the growth rate by in situ reducing titanium chloride with metallic titanium.  $\\mathrm{TiCl}_3$  species formed seemed to be able to utilize the active surface site more effectively than  $\\mathrm{TiCl}_4$ . The  $\\mathrm{WF}_6\\mathrm{- NH}_3$  process mentioned above has resulted in a remarkably higher growth rate of  $2.55\\mathrm{\\AA}$  cycle [28]. The TiN films made by chloride- ammonia processes have shown  $100\\%$  conformance [2,93] and good barrier properties up to  $650^{\\circ}\\mathrm{C}$  [94]. Barrier characteristics of 10- and  $20\\mathrm{- nm}$ - thick ALD TiN films deposited at 350 and  $400^{\\circ}\\mathrm{C}$  were examined by high frequency capacitance/voltage measurements on MOS capacitors (Cu gate, TiN,  $\\mathrm{SiO}_2$  dielectric and TaN passivation). The capacitors were stressed at  $2\\mathrm{MV / cm}$  at 200 and  $300^{\\circ}\\mathrm{C}$  for  $4\\mathrm{h}$ . A rapid initial flatband shift took place but stressing for longer times did not cause any further shift indicating no significant Cu diffusion into  $\\mathrm{SiO}_2$  [95]. The biased temperature stress tests of  $3\\mathrm{nm}$  TiN films deposited on $200\\mathrm{- mm}$  wafers have shown excellent leakage properties after stressing up to  $2\\mathrm{MV / cm}$  at  $200^{\\circ}\\mathrm{C}$  for 12 days [96].",
        "page_idx": 5
    },
    {
        "type": "text",
        "text": "",
        "page_idx": 5
    },
    {
        "type": "text",
        "text": "Transition metal nitride films can be deposited from alkyl amides and ammonia with high growth rate at low temperatures [42,43], but the alkyl amides are also quite prone to self- decomposition. TiN films deposited by these reactions have been amorphous and contained some carbon (4 at.%) and hydrogen (6 at.%) impurities [97]. The films have shown excellent conformality and negligible interdiffusion of Cu and/or Si at temperatures lower than  $600^{\\circ}\\mathrm{C}$ , but  $650^{\\circ}\\mathrm{C}$  triggered the diffusion [98]. Silicon containing films have shown better barrier properties; for example in a  $\\mathrm{Cu / Ti_{0.32}Si_{0.18}N_{0.50} / SiO_2 / }$  Si structure, no interdiffusion was detected after annealing at  $800^{\\circ}\\mathrm{C}$  for  $60\\mathrm{min}$  in  $\\mathrm{H}_2(10\\%) - \\mathrm{Ar}(90\\%)$  [43]. The films suffered from high resistivities, however.",
        "page_idx": 5
    },
    {
        "type": "text",
        "text": "6. Metal films and plasma-ALD",
        "text_level": 1,
        "page_idx": 5
    },
    {
        "type": "text",
        "text": "A copper ALD process would offer an interesting alternative for IC metallizations. Cu films have been deposited by ALD using hydrogen as a reducing agent for  $\\mathrm{CuCl}$  and  $\\mathrm{Cu(thd)}_2$  [99]. Both processes seem to be substrate material- dependent, indicating that the substrate (Pt and Pd) actively participates or catalyzes the growth reaction.  $\\mathrm{CuCl}$  and also  $\\mathrm{MoCl}_5$  can also be reduced to metal by zinc vapor [100,101]. The processes suffer, however, from a reversible dissolution- outdiffusion of zinc into the  $\\mathrm{Cu}$  and  $\\mathrm{Mo}$  films. The well- known solution (electroless deposition) chemistry for copper deposition where the reduction is carried out by organic compounds (formaldehyde, alcohols) has successfully been employed in ALD [102]. The  $\\mathrm{Cu}$  precursor used was 1,1,1,5,5,5- hexafluoroacetylacetonate hydrate and low- resistivity  $(1.78 - 4.25\\mu \\Omega)$  films were deposited at  $300^{\\circ}\\mathrm{C}$ . Other thermal ALD metal processes studied so far involve tungsten and nickel. In deposition of tungsten, the  $\\mathrm{WF}_6\\mathrm{- Si}_2\\mathrm{H}_6$ - process was employed [27]. Nickel deposition involves a two- step process where first  $\\mathrm{NiO}$  is grown from  $\\mathrm{Ni(acac)}_2$ , and ozone and then the oxide is converted to metal upon annealing in hydrogen atmosphere at  $260^{\\circ}\\mathrm{C}$  [103].",
        "page_idx": 5
    },
    {
        "type": "text",
        "text": "In deposition of nitride and metal films thermal energy is not necessarily enough to activate the reactions. Therefore, plasma enhanced growth has also been introduced to ALD. Thin films of inert refractory materials are used in semiconductor interconnect applications as diffusion barrier, seed and adhesion layers. Ta and Ti/ TiN films are typical examples of these. Rossnagel et al. [104] deposited  $100\\%$  conformal Ta and Ti films at  $25 - 400^{\\circ}\\mathrm{C}$  using a plasma enhanced ALD process, where  $\\mathrm{TaCl}_5$  and  $\\mathrm{TiCl}_4$  were reduced by atomic hydrogen generated upstream with an inductively coupled RF plasma discharge. Chlorine residues were below 3 at.  $\\%$  and the films deposited below  $250^{\\circ}\\mathrm{C}$  were amorphous.",
        "page_idx": 5
    },
    {
        "type": "text",
        "text": "More detailed studies of Ti films with QCM system and several different substrate materials have revealed that the growth process is independent of  $\\mathrm{TiCl_4}$  exposure above  $5000~\\mathrm{L}$  and the growth is also saturated with increasing hydrogen plasma power and atomic hydrogen exposure time [105].",
        "page_idx": 6
    },
    {
        "type": "text",
        "text": "Atomic hydrogen has also facilitated the epitaxial growth of silicon at  $550–110^{\\circ}\\mathrm{C}$  from dichlorosilane both on silicon (100) and (111) surfaces [106,107]. The ideal 1 ML/cycle growth can be achieved only when hydrogen pressure is optimized.",
        "page_idx": 6
    },
    {
        "type": "text",
        "text": "Plasma assistance has also been used in ALD growth of nitride and oxide films. Tetrabutylimidotris(diethylamido)tantalum has been reduced to TaN by hydrogen radicals produced by capacitively coupled RF plasma source [46]. The use of nitrogen radicals is also possible [108]. High- quality aluminum oxide films have been deposited by plasma enhanced ALD. After the aluminum precursor (dimethylethylamine alane) pulse, the reactor was pumped down and  $\\mathrm{H}_{2}$  plasma was introduced. Then the aluminum layer was oxidized with  $\\mathrm{O}_2$  plasma [109]; 15- nm- thick  $\\mathrm{Al}_2\\mathrm{O}_3$  films were grown by repeating the process. The films showed very good electrical properties and the properties could be even improved by post- deposition oxygen- plasma annealing at  $200^{\\circ}\\mathrm{C}$ . The advantages of  $\\mathrm{O}_2$  plasma have also been shown in deposition of tantalum oxide films from ethoxide and aminoethoxide  $\\{\\mathrm{Ta}(\\mathrm{OEt})_2[\\mathrm{OC}_2\\mathrm{H}_2\\mathrm{N}(\\mathrm{CH}_3)_2\\}$ , zirconium oxide film from  $t$ - butoxide and aluminum oxide from TMA [110,111]. For example, the growth rate could be increased by  $50–100\\%$  by using the  $\\mathrm{O}_2$  plasma.",
        "page_idx": 6
    },
    {
        "type": "text",
        "text": "7. Conclusions",
        "text_level": 1,
        "page_idx": 6
    },
    {
        "type": "text",
        "text": "The ALD method has already shown its versatility in industrial use for deposition of dielectric and luminescent films for electroluminescent flat panel displays. The big challenge to ALD is to gain an established position in microelectronics. It has great potential because of the accurate thickness control in deposition of very thin films and  $100\\%$  conformality. The first processes suggested for ALD in microelectronics are TiN barriers and gate oxides. The use of plasma activation will expand the ALD thin film materials selection. Because of the promising results obtained with plasma- ALD, it will surely increase in use in the future.",
        "page_idx": 6
    },
    {
        "type": "text",
        "text": "References",
        "text_level": 1,
        "page_idx": 6
    },
    {
        "type": "text",
        "text": "[1] T. Suntola, Mater. Sci. Rep. 4 (1989) 261. [2] M. Ritala, M. Leskelä, J.- P. Dekker, C. Mutsaers, P.J. Soininen, J. Skarp, Chem. Vap. Depos. 5 (1999) 7. [3] K. Kukli, M. Ritala, M. Leskelä, Appl. Phys. Lett. 66 (1996) 3737. [4] M. Ritala, K. Kukli, A. Rahtu, et al., Science 288 (2000) 319. [5] T. Suntola, J. Antson, US Patent no. 4,058,430, 1977.",
        "page_idx": 6
    },
    {
        "type": "text",
        "text": "[6] M. Leskelä, L. Niinistö, in: T. Suntola, M. Simpson (Eds.), Atomic Layer Epitaxy, Blackie, Glasgow, 1990, p. 1. [7] J. Nishizawa, H. Abe, T. Kurabayashi, J. Electrochem. Soc. 132 (1985) 1197. [8] S.M. Bedair, M.A. Tischler, T. Katsuyama, N.A. El- Masry, Appl. Phys. Lett. 47 (1985) 51. [9] T. Yao, in: T. Suntola, M. Simpson (Eds.), Atomic Layer Epitaxy, Blackie, Glasgow, 1990, p. 155. [10] J.C. Demmin, Solid State Technol. 44 (2001) 68. [11] S. Haukka, E. Lakomaa, T. Suntola, Stud. Surf. Sci. Catal. 120 (1999) 715. [12] M. Ritala, M. Leskelä, Nanotechnology 10 (1999) 19. [13] L. Niinistö, Curr. Opin. Solid State Mater. Sci. 3 (1998) 147. [14] L. Niinistö, Proceedings of the CAS International Semiconductor Conference, vol. 1, Sinaia, Romania, 2000, p. 33. [15] M. Leskelä, M. Ritala, J. Phys. IV 9 (1999) Pr8- 837. [16] M. Ritala, A. Leskelä, in: H.S. Nalwa (Ed.), Handbook of Thin Film Materials, vol. 1, Academic Press, San Diego, CA, 2001, p. 103. [17] S. Haukka, E.- L. Lakomaa, A. Root, J. Phys. Chem. 97 (1993) 5085. [18] R. Matero, A. Rahtu, M. Ritala, M. Leskelä, T. Sajavaara, Thin Solid Films 368 (2000) 1. [19] M. Leskelä, H. Mölsä, L. Niinistö, Supercond. Sci. Technol. 6 (1993) 627. [20] M. Tammenmaa, M. Asplund, H. Antson, et al., J. Cryst. Growth 84 (1987) 151. [21] M. Putkonen, T. Sajavaara, L.- S. Johansson, L. Niinistö, Chem. Vap. Depos. 7 (2001) 44. [22] M. Nieminen, M. Pukonen, L. Niinistö, Appl. Surf. Sci. 174 (2001) 155. [23] M. Vehkamäki, T. Hatanpää, T. Hänninen, M. Ritala, M. Leskelä, Electrochem. Solid State Lett. 2 (1999) 504. [24] J. Ihanus, T. Hänninen, T. Hatanpää, T. Aaltonen, I. Mutikainen, T. Sajavaara, J. Keinonen, M. Ritala, M. Leskelä, Chem. Mater. (In press). [25] J.D. Ferguson, S.M. George, Atomic Layer Deposition, Topical Conference, American Vacuum Society, Monterey, CA, USA, May 14- 15, 2001. [26] Y. Shimogaki, H. Hamamura, R. Yamamoto, K.Y. Jun, I. Nishinaka, Atomic Layer Deposition, Topical Conference, American Vacuum Society, Monterey, CA, USA, May, 14- 15, 2001. [27] J.W. Klaus, S.J. Ferro, S.M. George, Thin Solid Films 360 (2000) 145. [28] J.W. Klaus, S.J. Ferro, S.M. George, J. Electrochem. Soc. 147 (2000) 1175. [29] H.S. Sim, Y.T. Kim, H. Jeon, Atomic Layer Deposition, Topical Conference, American Vacuum Society, Monterey, CA, USA, May 14- 15, 2001. [30] P. Tägström, P. Mårtensson, U. Jansson, J.- O. Carlsson, J. Electrochem. Soc. 146 (1999) 3139. [31] M. Ritala, M. Leskelä, E. Rauhala, J. Jokinen, J. Electrochem. Soc. 145 (1998) 2916. [32] K. Kukli, M. Ritala, M. Schuisky, et al., Chem. Vap. Depos. 6 (2000) 303. [33] K. Kukli, A. Aidla, J. Aarik, et al., Langmuir 16 (2000) 8122. [34] K. Kukli, K. Forsgren, M. Ritala, M. Leskelä, J. Aarik, A. Härsta, J. Electrochem. Soc. 148 (2001) F227. [35] K. Kukli, K. Forsgren, J. Aarik, et al., J. Cryst. Growth 231 (2001) 262. [36] K. Kukli, J. Aarik, A. Aidla, et al., Chem. Mater. 13 (2001) 122. [37] M. Schuisky, A. Härsta, A. Aidla, K. Kukli, A.- A. Kiisler, J. Aarik, J. Electrochem. Soc. 147 (2000) 3319.",
        "page_idx": 6
    },
    {
        "type": "text",
        "text": "[38] M. Schuisky, K. Kukli, M. Ritala, A. Harsta, M. Leskelä, Chem. Vap. Depos. 6 (2000) 139. [39] K. Kukli, M. Ritala, M. Leskelä, Chem. Vap. Depos. 6 (2000) 297. [40] R. Matero, M. Ritala, M. Leskelä, A.C. Jones, P.A. Williams, J.F. Bickley, A. Steiner, T.J. Leedham, H.O. Davis, E- MRS, Strasbourg, June 5- 8, 2001. [41] J.C. Badot, S. Ribes, E.B. Yousfi, et al., Electrochem. Solid State Lett. 3 (2000) 485. [42] R.G. Gordon, J. Becker, D. Hausman, Atomic Layer Deposition, Topical Conference, American Vacuum Society, Monterey, CA, USA, May 14- 15, 2001. [43] J.- S. Min, H.- S. Park, S.- W. Kang, Appl. Phys. Lett. 75 (1999) 1521. [44] J.- S. Min, J.- S. Park, H.- S. Park, S.- W. Kang, J. Electrochem. Soc. 147 (2000) 3868. [45] J.- S. Park, M.- J. Lee, C.- S. Lee, S.- W. Kang, Electrochem. Solid State Lett. 4 (2001) C17. [46] J.Y. Kim, H.K. Kim, S.W. Seo, Y. Kim, Y.D. Kim, H. Jeon, Atomic Layer Deposition, Topical Conference, American Vacuum Society, Monterey, CA, USA, May 14- 15, 2001. [47] T. Hatanpaa, J. Inanus, J. Kansikas, I. Mutikainen, M. Ritala, M. Leskelä, Chem. Mater. 7 (1999) 1846. [48] E.B. Yousfi, B. Weinberger, F. Donsanti, P. Cowache, D. Lincot, Thin Solid Films 387 (2001) 29. [49] K.H. Hwang, S.J. Choi, J.D. Lee, Y.S. You, Y.K. Kim, H.S. Kim, C.L. Song, S.I. Lee, Atomic Layer Deposition, Topical Conference, American Vacuum Society, Monterey, CA, USA, May 14- 15, 2001. [50] M. Schuisky, J. Aarik, K. Kukli, A. Aidla, J. Lu, A. Harsta, Atomic Layer Deposition, Topical Conference, American Vacuum Society, Monterey, CA, USA, May 14- 15, 2001. [51] J.P. Chang, Y.- S. Lin, Atomic Layer Deposition, Topical Conference, American Vacuum Society, Monterey, CA, USA, May 14- 15, 2001. [52] J. Aarik, A. Aidla, A. Jaek, A.- A. Kiisler, A.- A. Tammik, Acta Polytechn. Scand., Chem. Technol. 195 (1990) 201. [53] K. Kukli, J. Aarik, A. Aidla, H. Siimon, M. Ritala, M. Leskelä, Appl. Surf. Sci. 112 (1996) 236. [54] M. Ritala, M. Juppo, K. Kukli, A. Rahtu, M. Leskelä, J. Phys. IV France 9 (1999) Pr8- 1021. [55] M. Juppo, A. Rahtu, M. Ritala, M. Leskelä, Langmuir 16 (2000) 4034. [56] A. Rahtu, M. Ritala, Electrochem. Soc. Proc. 2000- 13 (2000) 105. [57] A. Rosenthal, A. Tarre, P. Adamson, A. Gerst, A. Kasikov, A. NiiLisk, Appl. Surf. Sci. 142 (1999) 204. [58] J. Aarik, A. Aidla, H. Mandar, V. Sammelselg, J. Cryst. Growth 220 (2000) 531. [59] J. Aarik, A. Aidla, H. Mandar, T. Uustare, Appl. Surf. Sci. 172 (2001) 148. [60] J. Aarik, A. Aidla, V. Sammelselg, T. Uustare, M. Ritala, M. Leskelä, Thin Solid Films 370 (2000) 163. [61] J. Aarik, A. Aidla, T. Uustare, M. Ritala, M. Leskelä, Appl. Surf. Sci. 161 (2000) 385. [62] A. Rahtu, T. Alaranta, M. Ritala, Langmuir 17 (2001) 6506. [63] E.B. Yousfi, J. Fouache, D. Lincot, Appl. Surf. Sci. 153 (2000) 223. [64] R. Matero, A. Rahtu, M. Ritala, Chem. Mater. 13 (2001) 4506. [65] A. Rahtu, M. Ritala, Chem. Vap. Depos. 8 (2002) 21. [66] A. Rahtu, K. Kukli, M. Ritala, Chem. Mater. 13 (2001) 817. [67] A. Rahtu, T. Hanninen, M.J. Ritala, Phys. IV France, Submitted. [68] M. Juppo, A. Rahtu, M. Ritala, Chem. Mater. 14 (2002) 281. [69] K. Kukli, M. Ritala, R. Matero, M. Leskelä, J. Cryst. Growth 212 (2000) 459.",
        "page_idx": 7
    },
    {
        "type": "text",
        "text": "[70] J. Aarik, A. Aidla, H. Mändar, T. Uustare, K. Kukli, M. Schuisky, Appl. Surf. Sci. 173 (2001) 15. [71] K. Kukli, M. Ritala, M. Leskelä, J. Appl. Phys. 86 (1999) 5656. [72] K. Kukli, M. Ritala, M. Leskelä, J. Electrochem. Soc. 148 (2001) F35. [73] E.P. Gusev, M. Copel, E. Cartier, I.J.R. Baumvol, C. Krug, M.A. Gribelyuk, Appl. Phys. Lett. 76 (2000) 176. [74] M. Copel, E. Cartier, E.P. Gusev, S. Guha, N. Bojarczuk, M. Poppeler, Appl. Phys. Lett. 78 (2001) 2670. [75] G.D. Wilk, R.M. Wallace, J.M. Anthony, J. Appl. Phys. 89 (2001) 5243. [76] W.S. Yang, Y.K. Kim, S.- Y. Yang, et al., Surf. Coat. Technol. 131 (2000) 79. [77] M. Houssa, A. Stesmans, M. Naili, M.M. Heyns, Appl. Phys. Lett. 77 (2000) 1381. [78] E.P. Gusev, E. Cartier, D.A. Buchanan, et al., Atomic Layer Deposition, Topical Conference, American Vacuum Society, Monterey, CA, USA, May 14- 15, 2001. [79] M. Copel, M.A. Gribelyuk, E. Gusev, Appl. Phys. Lett. 76 (2000) 436. [80] C.M. Perkins, B.B. Triplett, P.C. McIntyre, K.C. Saraswat, S. Haukka, M. Tuominen, Appl. Phys. Lett. 78 (2001) 2357. [81] H. Zhang, R. Solanki, B. Robends, G. Bai, I. Banerjee, J. Appl. Phys. 87 (2000) 1921. [82] K. Kukli, M. Ritala, M. Leskelä, T. Sajavaara, J. Keinonen, D. Gilmer, S. Bagchi, L. Prabhu, J. Non- Cryst. Solids (In press).[83] W.F.A Besling, S. Haukka, M. Tuchinen, Atomic Layer Deposition, Topical Conference, American Vacuum Society, Monterey, CA, USA, May 14- 15, 2001. [84] K. Kukli, M. Ritala, M. Leskelä, Chem. Mater. 12 (2000) 1914. [85] A. Rahtu, M. Ritala, M. Leskelä, Chem. Mater. 13 (2001) 1528. [86] M. Vehkamäki, T. Hanninen, M. Ritala, et al., Chem. Vap. Depos. 7 (2001) 75. [87] M. Ritala, K. Kukli, M. Vehkamäki, et al., Electrochem. Soc. Proc. 2000- 13 (2000) 597. [88] M. Putkonen, A. Kosola, L. Niinisto, To be submitted.[89] M. Ritala, P. Kalsi, D. Riihela, K. Kukli, M. Leskelä, J. Jokinen, Chem. Mater. 11 (1999) 1712. [90] M. Ritala, M. Leskelä, E. Rauhala, P. Haussalo, J. Electrochem. Soc. 142 (1995) 1670. [91] M. Juppo, P. Alen, M. Ritala, M. Leskelä, Chem. Vap. Depos. 7 (2001) 211. [92] M. Juppo, M. Ritala, M. Leskelä, J. Electrochem. Soc. 147 (2000) 3377. [93] K.- E. Elers, V. Saanila, P.J. Soininen, S. Haukka, MRS Proc. (in press).[94] P. Martensson, M. Juppo, M. Ritala, M. Leskelä, J.- O. Carlsson, J. Vac. Sci. Technol. B 17 (1999) 2122. [95] A. Satta, G. Beyer, K. Maex, K.- E. Elers, S. Haukka, A. Vantomme, Mater. Res. Soc. Symp. Proc. 612 (2000) D6.5.1. [96] S.R. Smith, K.- E. Elers, Atomic Layer Deposition, Topical Conference, American Vacuum Society, Monterey, CA, USA, May 14- 15, 2001. [97] J.- S. Min, H.S. Park, W. Koh, S.- W. Kang, Mater. Res. Soc. Symp. Proc. 564 (1999) 207. [98] D.- J. Kim, Y.- B. Young, M.- B. Lee, Y.- H. Lee, J.- H. Lee, J.- H. Lee, Thin Solid Films 372 (2000) 276. [99] P. Martensson, Acta Univ. Uppsala, Comprehensive Summaries of Uppsala Dissertations from the Faculty of Science and Technology, 421 (1999) and the publications therein.[100] M. Juppo, M. Ritala, M. Leskelä, J. Vac. Sci. Technol. A 15 (1997) 2330.",
        "page_idx": 7
    },
    {
        "type": "text",
        "text": "[101] M. Juppo, M. Vehkamäki, M. Ritala, M. Leskelä, J. Vac. Sci. Technol. A 16 (1998) 2845.  [102] R. Solanki, B. Pathangey, Electrochem. Solid State Lett. 3 (2000) 479.  [103] M. Utriainen, M. Kröger- Laukkanen, L.- S. Johansson, L. Niinistö, Appl. Surf. Sci. 157 (2000) 151.  [104] S.M. Rossnagel, A. Sherman, F. Turner, J. Vac. Sci. Technol. B 18 (2000) 2016.  [105] H. Kim, S.M. Rossnagel, Atomic Layer Deposition, Topical Conference, American Vacuum Society, Monterey, CA, USA, May 14–15, 2001.  [106] Y. Satoh, K. Ikeda, S. Sugahara, M. Matsumura, Jpn. J. Appl. Phys. 39 (2000) 5732.",
        "page_idx": 8
    },
    {
        "type": "text",
        "text": "[107] E. Hasunumu, S. Sugahara, S. Hoshina, S. Imai, K. Ikeda, M. Matsumura, J. Vac. Sci. Technol. A 16 (1998) 679.  [108] S.- W. Kang, Atomic Layer Deposition, Topical Conference, American Vacuum Society, Monterey, CA, USA, May 14–15, 2001.  [109] C.- W. Jeong, J.- S. Lee, S.- K. Joo, Jpn. J. Appl. Phys. 285 (2001) 285.  [110] S.W. Choi, C.- S. Lee, W. Koh, et al., Atomic Layer Deposition, Topical Conference, American Vacuum Society, Monterey, CA, USA, May 14–15, 2001.  [111] T. Doh, J. Koo, Y. Kim, J. Han, Y. Kim, H. Jeon, Atomic Layer Deposition, Topical Conference, American Vacuum Society, Monterey, CA, USA, May 14–15, 2001.",
        "page_idx": 8
    }
]